app/controllers/plants_controller.rb

  def show
    @plant = Plant.find(params[:id])
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT 1  [["id", 0]]

  def create
    @plant = Plant.new(plant_params)
    @plant.user = current_user
      if @plant.save
---
INSERT INTO "plants" ("plant_name", "description", "notes", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["plant_name", "test plant"], ["description", "blah "], ["notes", "blahblah"], ["user_id", 1], ["created_at", "2015-07-28 21:07:00.586858"], ["updated_at", "2015-07-28 21:07:00.586858"]]